<a href="https://colab.research.google.com/github/srinivasan-06/Python_for_DataScience-/blob/main/PandasHandson_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import pandas by typing the following code in the notebook and run it by
pressing shift + enter

In [2]:
import pandas as pd
import numpy as np

 Type the following code to create a pandas series using np.array with
default index

In [4]:
series = pd.Series(np.array([1,2,3,4,5]))
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
series = pd.Series(np.array([1,2,3,4,5]), index = ['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

Type the following code to create a pandas series using a dictionary with
default index

In [7]:
series = pd.Series({'x' : 10, 'y' : 12, 'z' : 13})
series

x    10
y    12
z    13
dtype: int64